import React from 'react';

export default class Help extends React.Component {
	render() {
		return (
			<div>
				<h4 className="container">Help</h4>
				<p className="container">
					Комп'ютерна програма «Розумній дім» створена для збереження записів про температуру, вологість, тиск, 
					витрати електроенергії та змоги отримання деякої інформації про них.
					<p>Комп'ютерна програма надає можливість:
						<li>Читати інформацію з файлу.</li>
						<li>Вводити нову інформацію з клавіатури. Видаляти записи у таблиці</li>
						<li>Показувати графіки температури, тиску та вологості</li>
						<li>Показувати середню вологість за місяць, дні з найвищим та найнижчим тиском, дні з використанням електроенергії більше 5квт, середню температуру і найвищу вологість за визначений період, періоди, коли амплітуда тиску змінювалась в межах 1.43%, а температура 5.673%, передбачення використання електроенергії на наступний місяць</li>
					</p> 
				</p>
			</div>
		)
	}
}